jQuery(document).ready(function() {

	var eng_num = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"];

	var nep_num = ["०", "१", "२", "३", "४", "५", "६", "७", "८", "९"];
	
	var select_box_id = ["pradesh-list", "district-list", "gau-nagar-palika-list", "ward-list"];

	var pradesh = ["प्रदेश नम्बर-१", "प्रदेश नम्बर-२", "बागमती प्रदेश", "गण्डकी प्रदेश", "लुम्बिनी प्रदेश", "कर्णाली प्रदेश", "सुदूरपश्चिम प्रदेश"];

	var pradesh_district = [
		["ताप्लेजुङ", "पाँचथर", "ईलाम", "झापा", "मोरंग", "सुनसरी", "धनकुटा", "तेहथुम", "संखुवासभा", "भोजपुर", "सोलुखुम्बु", "ओखलढुंगा", "खोटाङ", "उदयपुर"],
		["सप्तरी", "सिराहा", "धनुषा", "महोत्तरी", "सर्लाही", "रौतहट", "वारा", "पर्सा"], 
		["सिन्धुली", "रामेछाप", "दोलखा", "सिन्धुपाल्चोक", "काभ्रेपलान्चोक", "ललितपुर", "भक्तपुर", "काठमाण्डौ", "नुवाकोट", "रसुवा", "धादिङ", "मकवानपुर", "चितवन"], 
		["गोरखा", "लमजुङ", "तनहुँ", "स्याङजा", "कास्की", "मनाङ", "मुस्ताङ", "म्याग्दी", "पर्वत", "वाग्लुङ", "नवलपरासी (बर्दघाट सुस्ता पूर्व)"], 
		["गुल्मी", "पाल्पा", "रुपन्देही", "कपिलबस्तु", "अर्घाखाँची", "प्यूठान", "रोल्पा", "दाङ", "बाँके", "बर्दिया", "नवलपरासी (बर्दघाट सुस्ता पश्चिम)", "रुकुम (पूर्वी भाग)"], 
		["सल्यान", "सुर्खेत", "दैलेख", "जाजरकोट", "डोल्पा", "जुम्ला", "कालिकोट", "मुगु", "हुम्ला", "रुकुम (पश्चिम भाग)"], 
		["बाजुरा", "बझाङ", "अछाम", "डोटी", "कैलाली", "कञ्चनपुर", "डडेलधुरा", "बैतडी", "दार्चुला"],
	];

	var sthaniya_palika = [
		[
			["फुङलिङ नगरपालिका-७", "आठराई त्रिवेणी गाउँपालिका-५", "सिदिङ्वा गाउँपालिका-७", "फक्ताङलुङ गाउँपालिका-७", "मिक्वाखोला गाउँपालिका-५", "मेरिङदेन गाउँपालिका-६", "मैवाखोला गाउँपालिका-६", "पाथीभरा याङवरक गाउँपालिका-६", "सिरीजङ्घा गाउँपालिका-८"], 
			["फिदिम नगरपालिका-१४", "फालेलुङ गाउँपालिका-८", "फाल्गुनन्द गाउँपालिका-७", "हिलिहाङ गाउँपालिका-७", "कुम्मायक गाउँपालिका-५", "मिक्लाजुङ गाउँपालिका-८", "तुम्बेवा गाउँपालिका-५", "याङवरक गाउँपालिका-६"], 
			["ईलाम नगरपालिका-१२", "देउमाई नगरपालिका-९", "माई नगरपालिका-१०", "सूर्योदय नगरपालिका-१४", "फाकफोकथुम गाउँपालिका-७", "चुलाचुली गाउँपालिका-६", "माईजोगमाई गाउँपालिका-६", "माङसेबुङ गाउँपालिका-६", "रोङ गाउँपालिका-६", "सन्दकपुर गाउँपालिका-५"], 
			["मेचीनगर नगरपालिका-१५", "दमक नगरपालिका-१०", "कन्काई नगरपालिका-९", "भद्रपुर नगरपालिका-१०", "अर्जुनधारा नगरपालिका-११", "शिवशताक्षी नगरपालिका-११", "गौरादह नगरपालिका-९", "विर्तामोड नगरपालिका-१०", "कमल गाउँपालिका-७", "गौरीगंज गाउँपालिका-६", "बाह्रदशी गाउँपालिका-७", "झापा गाउँपालिका-७", "बुद्धशान्ति गाउँपालिका-७", "हल्दिवारी गाउँपालिका-५", "कचनकवल गाउँपालिका-७"], 
			["विराटनगर महानगरपालिका-१९", "बेलवारी नगरपालिका-११", "लेटाङ नगरपालिका-९", "पथरी शनिश्चरे नगरपालिका-१०", "रंगेली नगरपालिका-९", "रतुवामाई नगरपालिका-१०", "सुनवर्षि नगरपालिका-९", "उर्लावारी नगरपालिका-९", "सुन्दरहरैचा नगरपालिका-१२", "बुढीगंगा गाउँपालिका-९", "धनपालथान गाउँपालिका-७", "ग्रामथान गाउँपालिका-७", "जहदा गाउँपालिका-७", "कानेपोखरी गाउँपालिका-७", "कटहरी गाउँपालिका-७", "केरावारी गाउँपालिका-१०", "मिक्लाजुङ गाउँपालिका-९"], 
			["ईटहरी उपमहानगरपालिका-२०", "धरान उपमहानगरपालिका-२०", "ईनरुवा नगरपालिका-१०", "दुहवी नगरपालिका-१२", "रामधुनी नगरपालिका-९", "बराहक्षेत्र नगरपालिका-११", "देवानगञ्ज गाउँपालिका-७", "कोशी गाउँपालिका-८", "गढी गाउँपालिका-६", "बर्जु गाउँपालिका-६", "भोक्राहा नरसिंह गाउँपालिका-८", "हरिनगर गाउँपालिका-७"], 
			["पाख्रिबास नगरपालिका-१०", "धनकुटा नगरपालिका-१०", "महालक्ष्मी नगरपालिका-९", "साँगुरीगढी गाउँपालिका-१०", "सहिदभूमि गाउँपालिका-७", "छथर जोरपाटी गाउँपालिका-६", "चौविसे गाउँपालिका-८"], 
			["म्याङलुङ नगरपालिका-१०", "लालीगुराँस नगरपालिका-१०", "आठराई गाउँपालिका-७", "छथर गाउँपालिका-६", "फेदाप गाउँपालिका-५", "मेन्छयायेम गाउँपालिका-६"], 
			["चैनपुर नगरपालिका-११", "धर्मदेवी नगरपालिका-९", "खाँदवारी नगरपालिका-११", "मादी नगरपालिका-९", "पाँचखपन नगरपालिका-९", "भोटखोला गाउँपालिका-५", "चिचिला गाउँपालिका-५", "मकालु गाउँपालिका-६", " सभापोखरी गाउँपालिका-६", "सिलीचोङ गाउँपालिका-५"], 
			["भोजपुर नगरपालिका-१२", "षडानन्द नगरपालिका-१४", "टेम्केमैयुङ गाउँपालिका-९", "रामप्रसाद राई गाउँपालिका-८", "अरुण गाउँपालिका-७", "पौवादुङमा गाउँपालिका-६", "साल्पासिलिछो गाउँपालिका-६", "आमचोक गाउँपालिका-१०", "हतुवागढी गाउँपालिका-९"], 
			["सोलुदुधकुण्ड नगरपालिका-११", "माप्य दुधकोशी गाउँपालिका-७", "खुम्वु पासाङल्हमु गाउँपालिका-४", "थुलुङ दुधकोशी गाउँपालिका-९", "नेचासल्यान गाउँपालिका-५", "माहाकुलुङ गाउँपालिका-५", "लिखु पिके गाउँपालिका-५", "सोताङ गाउँपालिका-५"], 
			["सिद्दिचरण नगरपालिका-१२", "जिदेम्बा गाउँपालिका-९", "चम्पादेवी गाउँपालिका-१०", "चिशंखुगढी गाउँपालिका-८", "मानेभञ्याङ गाउँपालिका-९", "मोलुङ गाउँपालिका-८", "लिखु गाउँपालिका-९", "सुनकोशी गाउँपालिका-१०"], 
			["हलेसी तुवाचुङ नगरपालिका-११", "दिक्तेल रुपाकोट मझुवागढी नगरपालिका-१५", "ऐसेलुखर्क गाउँपालिका-७", "रावा बेसी गाउँपालिका-६", "जन्तेढुंगा गाउँपालिका-६", "खोटेहाङ गाउँपालिका-९", "केपिलासगढी गाउँपालिका-७", "दिप्रुङ चुइचुम्मा गाउँपालिका-७", "साकेला गाउँपालिका-५", "वराहपोखरी गाउँपालिका-६"], 
			["कटारी नगरपालिका-१४", "चौदण्डीगढी नगरपालिका-१०", "त्रियुगा नगरपालिका-१६", "वेलका नगरपालिका-९", "उदयपुरगढी गाउँपालिका-८", "ताप्ली गाउँपालिका-५", "रौतामाई गाउँपालिका-८", "लिम्चुङ्बुङ गाउँपालिका-५"]
		], 
		[
			["राजविराज नगरपालिका-१६", "कञ्चनरुप नगरपालिका-१२", "डाक्नेश्वरी नगरपालिका-१०", "बोदेबरसाईन नगरपालिका-१०", "खडक नगरपालिका-११", "शम्भुनाथ नगरपालिका-१२", "सुरुङ्गा नगरपालिका-११", "हनुमाननगर कङ्कालिनी नगरपालिका-१४", "सप्तकोशी नगरपालिका-११", "अग्निसाइर कृष्णासरवन गाउँपालिका-६", "छिन्नमस्ता गाउँपालिका-७", "महादेवा गाउँपालिका-६", "तिरहुत गाउँपालिका-५", "तिलाठी कोईलाडी गाउँपालिका-८", "रुपनी गाउँपालिका-६", "राजगढ गाउँपालिका-६", "बिष्णुपुर गाउँपालिका-७", "बलान बिहुल गाउँपालिका-६"], 
			["लहान नगरपालिका-२४", "धनगढीमाई नगरपालिका-१४", "सिरहा नगरपालिका-२२", "गोलबजार नगरपालिका-१३", "मिर्चैयाँ नगरपालिका-१२", "कल्याणपुर नगरपालिका-१२", "कर्जन्हा नगरपालिका-११", "सुखीपुर नगरपालिका-१०", "भगवानपुर गाउँपालिका-५", "औरही गाउँपालिका-५", "विष्णुपुर गाउँपालिका-५", "बरियारपट्टी गाउँपालिका-५", "लक्ष्मीपुर पतारी गाउँपालिका-६", "नरहा गाउँपालिका-५", "सखुवानान्कारकट्टी गाउँपालिका-५", "अर्नमा गाउँपालिका-५", "नवराजपुर गाउँपालिका-५"], 
			["जनकपुरधाम उपमहानगरपालिका-२५", "क्षिरेश्वरनाथ नगरपालिका-१०", "गणेशमान चारनाथ नगरपालिका-११", "धनुषाधाम नगरपालिका-९", "नगराइन नगरपालिका-९", "विदेह नगरपालिका-९", "मिथिला नगरपालिका-११", "शहीदनगर नगरपालिका-९", "सबैला नगरपालिका-१३", "कमला नगरपालिका-९", "मिथिला बिहारी नगरपालिका-१०", "हंसपुर नगरपालिका-९", "जनकनन्दिनी गाउँपालिका-६", "बटेश्वर गाउँपालिका-५", "मुखियापट्टी मुसहरमिया गाउँपालिका-६", "लक्ष्मीनिया गाउँपालिका-७", "औरही गाउँपालिका-६", "धनौजी गाउँपालिका-५"], 
			["जलेश्वर नगरपालिका-१२", "बर्दिबास नगरपालिका-१४", "गौशाला नगरपालिका-१२", "लोहरपट्टी नगरपालिका-९", "रामगोपालपुर नगरपालिका-९", "मनरा शिसवा नगरपालिका-१०", "मटिहानी नगरपालिका-९", "भँगाहा नगरपालिका-९", "बलवा नगरपालिका-११", "औरही नगरपालिका-९", "एकडारा गाउँपालिका-६", "सोनमा गाउँपालिका-८", "साम्सी गाउँपालिका-७", "महोत्तरी गाउँपालिका-६", "पिपरा गाउँपालिका-७"], 
			["ईश्वरपुर नगरपालिका-१५", "मलंगवा नगरपालिका-१२", "लालबन्दी नगरपालिका-१७", "हरिपुर नगरपालिका-९", "हरिपुर्वा नगरपालिका-९", "हरिवन नगरपालिका-११", "बरहथवा नगरपालिका-१८", "बलरा नगरपालिका-११", "गोडैटा नगरपालिका-१२", "बागमती नगरपालिका-१२", "कविलासी नगरपालिका-१०", "चक्रघट्टा गाउँपालिका-९", "चन्द्रनगर गाउँपालिका-७", "धनकौल गाउँपालिका-७", "ब्रह्मपुरी गाउँपालिका-७", "रामनगर गाउँपालिका-७", "विष्णु गाउँपालिका-८", "कौडेना गाउँपालिका-७", "पर्सा गाउँपालिका-६", "बसबरीया गाउँपालिका-६"], 
			["चन्द्रपुर नगरपालिका-१०", "गरुडा नगरपालिका-९", "गौर नगरपालिका-९", "बौधीमाई नगरपालिका-९", "बृन्दावन नगरपालिका-९", "देवाही गोनाही नगरपालिका-९", "गढीमाई नगरपालिका-९", "गुजरा नगरपालिका-९", "कटहरिया नगरपालिका-९", "माधव नारायण नगरपालिका-९", "मौलापुर नगरपालिका-९", "फतुवाबिजयपुर नगरपालिका-११", "ईशनाथ नगरपालिका-९", "परोहा नगरपालिका-९", "राजपुर नगरपालिका-९", "राजदेवी नगरपालिका-९", "दुर्गा भगवती गाउँपालिका-५", "यमुनामाई गाउँपालिका-५"], 
			["कलैया उपमहानगरपालिका-२७", "जीतपुर सिमरा उपमहानगरपालिका-२४", "कोल्हवी नगरपालिका-११", "निजगढ नगरपालिका-१३", "महागढीमाई नगरपालिका-११", "सिम्रौनगढ नगरपालिका-११", "पचरौता नगरपालिका-९", "आदर्श कोटवाल गाउँपालिका-८", "करैयामाई गाउँपालिका-८", "देवताल गाउँपालिका-७", "परवानीपुर गाउँपालिका-५", "प्रसौनी गाउँपालिका-७", "फेटा गाउँपालिका-७", "बारागढी गाउँपालिका-६", "सुवर्ण गाउँपालिका-८", "विश्रामपुर गाउँपालिका-५"], 
			["बिरगंज महानगरपालिका-३२", "पोखरिया नगरपालिका-१०", "बहुदरमाई नगरपालिका-९", "पर्सागढी नगरपालिका-९", "ठोरी गाउँपालिका-५", "जगरनाथपुर गाउँपालिका-६", "धोबीनी गाउँपालिका-५", "छिपहरमाई गाउँपालिका-५", "पकाहा मैनपुर गाउँपालिका-५", "बिन्दबासिनी गाउँपालिका-५", "सखुवा प्रसौनी गाउँपालिका-६", "पटेर्वा सुगौली गाउँपालिका-५", "कालिकामाई गाउँपालिका-५", "जिरा भवानी गाउँपालिका-५"]
		], 

		[
			["कमलामाई नगरपालिका-१४", "दुधौली नगरपालिका-१४", "गोलन्जर गाउँपालिका-७", "घ्याङलेख गाउँपालिका-५", "तीनपाटन गाउँपालिका-११", "फिक्कल गाउँपालिका-६", "मरिण गाउँपालिका-७", "सुनकोशी गाउँपालिका-७", "हरिहरपुरगढी गाउँपालिका-८"], 
			["मन्थली नगरपालिका-१४", "रामेछाप नगरपालिका-९", "उमाकुण्ड गाउँपालिका-७", "खाँडादेवी गाउँपालिका-९", "गोकुलगङ्गा गाउँपालिका-६", "दोरम्बा गाउँपालिका-७", "लिखु तामाकोशी गाउँपालिका-७", "सुनापती गाउँपालिका-५"], 
			["जिरी नगरपालिका-९", "भिमेश्वर नगरपालिका-९", "कालिन्चोक गाउँपालिका-९", "गौरीशङ्कर गाउँपालिका-९", "तामाकोशी गाउँपालिका-७", "मेलुङ्ग गाउँपालिका-७", "विगु गाउँपालिका-८", "वैतेश्वर गाउँपालिका-८", "शैलुङ्ग गाउँपालिका-८"], 
			["चौतारा साँगाचोकगढी नगरपालिका-१४", "बाह्रविसे नगरपालिका-९", "मेलम्ची नगरपालिका-१३", "ईन्द्रावती गाउँपालिका-१२", "जुगल गाउँपालिका-७", "पाँचपोखरी थाङपाल गाउँपालिका-८", "बलेफी गाउँपालिका-८", "भोटेकोशी गाउँपालिका-५", "लिसङ्खु पाखर गाउँपालिका-७", "सुनकोशी गाउँपालिका-७", "हेलम्बु गाउँपालिका-७", "त्रिपुरासुन्दरी गाउँपालिका-६"], 
			["धुलिखेल नगरपालिका-१२", "बनेपा नगरपालिका-१४", "पनौती नगरपालिका-१२", "पाँचखाल नगरपालिका-१३", "नमोबुद्ध नगरपालिका-११", "मण्डनदेउपुर नगरपालिका-१२", "खानीखोला गाउँपालिका-७", "चौंरीदेउराली गाउँपालिका-९", "तेमाल गाउँपालिका-९", "बेथानचोक गाउँपालिका-६", "भुम्लु गाउँपालिका-१०", "महाभारत गाँउपालिका-८", "रोशी गाउँपालिका-१२"], 
			["ललितपुर महानगरपालिका-२९", "गोदावरी नगरपालिका-१४", "महालक्ष्मी नगरपालिका-१०", "कोन्ज्योसोम गाउँपालिका-५", "बागमती गाउँपालिका-७", "महाङ्काल गाउँपालिका-६"], 
			["चाँगुनारायण नगरपालिका-९", "भक्तपुर नगरपालिका-१०", "मध्यपुर थिमी नगरपालिका-९", "सूर्यविनायक नगरपालिका-१०"], 
			["काठमाण्डौं महानगरपालिका-३२", "कागेश्वरी मनोहरा नगरपालिका-९", "कीर्तिपुर नगरपालिका-१०", "गोकर्णेश्वर नगरपालिका-९", "चन्द्रागिरी नगरपालिका-१५", "टोखा नगरपालिका-११", "तारकेश्वर नगरपालिका-११", "दक्षिणकाली नगरपालिका-९", "नागार्जुन नगरपालिका-१०", "बुढानिलकण्ठ नगरपालिका-१३", "शङ्खरापुर नगरपालिका-९"], 
			["विदुर नगरपालिका-१३", "बेलकोटगढी नगरपालिका-१३", "ककनी गाउँपालिका-८", "किस्पाङ गाउँपालिका-५", "तादी गाउँपालिका-६", "तारकेश्वर गाउँपालिका-६", "दुप्चेश्वर गाउँपालिका-७", "पञ्चकन्या गाउँपालिका-५", "लिखु गाउँपालिका-६", "म्यगङ गाउँपालिका-६", "शिवपुरी गाउँपालिका-८", "सुर्यगढी गाउँपालिका-५"], 
			["उत्तरगया गाउँपालिका-५", "कालिका गाउँपालिका-५", "गोसाईकुण्ड गाउँपालिका-६", "नौकुण्ड गाउँपालिका-६", "आमाछोदिङमो गाउँपालिका-५"], 
			["धुनीबेंशी नगरपालिका-९", "निलकण्ठ नगरपालिका-१४", "खनियाबास गाउँपालिका-५", "गजुरी गाउँपालिका-८", "गल्छी गाउँपालिका-८", "गङ्गाजमुना गाउँपालिका-७", "ज्वालामूखी गाउँपालिका-७", "थाक्रे गाउँपालिका-११", "नेत्रावती डबजोङ गाउँपालिका-५", "बेनीघाट रोराङ्ग गाउँपालिका-१०", "रुवी भ्याली गाउँपालिका-६", "सिद्धलेक गाउँपालिका-७", "त्रिपुरासुन्दरी गाउँपालिका-७"], 
			["हेटौडा उपमहानगरपालिका-१९", "थाहा नगरपालिका-१२", "इन्द्रसरोबर गाउँपालिका-५", "कैलाश गाउँपालिका-१०", "बकैया गाउँपालिका-१२", "बाग्मति गाउँपालिका-९", "भिमफेदी गाउँपालिका-९", "मकवानपुरगढी गाउँपालिका-८", "मनहरी गाउँपालिका-९", "राक्सिराङ्ग गाउँपालिका-९"], 
			["भरतपुर महानगरपालिका-२९", "कालिका नगरपालिका-११", "खैरहनी नगरपालिका-१३", "माडी नगरपालिका-९", "रत्ननगर नगरपालिका-१६", "राप्ती नगरपालिका-१३", "इच्छाकामना गाउँपालिका-७"]
		], 
		[
			["गोरखा नगरपालिका-१४", "पालुङटार नगरपालिका-१०", "बारपाक सुलिकोट गाउँपालिका-८", "सिरानचोक गाउँपालिका-८", "अजिरकोट गाउँपालिका-५", "आरूघाट गाउँपालिका-१०", "गण्डकी गाउँपालिका-८", "चुमनुव्री गाउँपालिका-७", "धार्चे गाउँपालिका-७", "भिमसेनथापा गाउँपालिका-८", "शहिद लखन गाउँपालिका-९"], 
			["बेसीशहर नगरपालिका-११", "मध्यनेपाल नगरपालिका-१०", "राईनास नगरपालिका-१०", "सुन्दरबजार नगरपालिका-११", "क्व्होलासोथार गाउँपालिका-९", "दूधपोखरी गाउँपालिका-६", "दोर्दी गाउँपालिका-९", "मर्स्याङदी गाउँपालिका-९"], 
			["भानु नगरपालिका-१३", "भिमाद नगरपालिका-९", "व्यास नगरपालिका-१४", "शुक्लागण्डकी नगरपालिका-१२", "आँबुखैरेनी गाउँपालिका-६", "ऋषिङ्ग गाउँपालिका-८", "घिरिङ गाउँपालिका-५", "देवघाट गाउँपालिका-५", "म्याग्दे गाउँपालिका-७", "वन्दिपुर गाउँपालिका-६"], 
			["गल्याङ नगरपालिका-११", "चापाकोट नगरपालिका-१०", "पुतलीबजार नगरपालिका-१४", "भीरकोट नगरपालिका-९", "वालिङ नगरपालिका-१४", "अर्जुनचौपारी गाउँपालिका-६", "आँधिखोला गाउँपालिका-६", "कालीगण्डकी गाउँपालिका-७", "फेदीखोला गाउँपालिका-५", "बिरुवा गाउँपालिका-८", "हरिनास गाउँपालिका-७"], 
			["पोखरा महानगरपालिका-३३", "अन्नपूर्ण गाउँपालिका-११", "माछापुच्छ्रे गाउँपालिका-९", "मादी गाउँपालिका-१२", "रूपा गाउँपालिका-७"], 
			["चामे गाउँपालिका-५", "नार्पा भूमि गाउँपालिका-५", "नासोँ गाउँपालिका-९", "मनाङ ङिस्याङ गाउँपालिका-९"], 
			["घरपझोङ गाउँपालिका-५", "थासाङ गाउँपालिका-५", "लो घेकर दामोदर गाउँपालिका-५", "लोमन्थाङ गाउँपालिका-५", "वारागुङ मुक्तिक्षेत्र गाउँपालिका-५"], 
			["बेनी नगरपालिका-१०", "अन्नपुर्ण गाउँपालिका-८", "धवलागिरी गाउँपालिका७", "मंगला गाउँपालिका-५", "मालिका गाउँपालिका-७", "रघुगंगा गाउँपालिका-८"], 
			["कुश्मा नगरपालिका-१४", "फलेवास नगरपालिका-११", "जलजला गाउँपालिका-९", "पैयूं गाउँपालिका-७", "महाशिला गाउँपालिका-६", "मोदी गाउँपालिका-८", "विहादी गाउँपालिका-६"], 
			["बागलुङ नगरपालिका-१४", "गल्कोट नगरपालिका-११", "जैमूनी नगरपालिका-१०", "ढोरपाटन नगरपालिका-९", "वरेङ गाउँपालिका-५", "काठेखोला गाउँपालिका-८", "तमानखोला गाउँपालिका-६", "ताराखोला गाउँपालिका-५", "निसीखोला गाउँपालिका-७", "वडिगाड गाउँपालिका-१०"], 
			["कावासोती नगरपालिका-१७", "गैडाकोट नगरपालिका-१८", "देवचुली नगरपालिका-१७", "मध्यविन्दु नगरपालिका-१५", "बौदीकाली गाउँपालिका-६", "बुलिङटार गाउँपालिका-६", "विनयी त्रिवेणी गाउँपालिका-७", "हुप्सेकोट गाउँपालिका-६"]
		], 
		[
			["मुसिकोट नगरपालिका-९", "रेसुङ्गा नगरपालिका-१४", "ईस्मा गाउँपालिका-६", "कालीगण्डकी गाउँपालिका-७", "गुल्मी दरबार गाउँपालिका-७", "सत्यवती गाउँपालिका-८", "चन्द्रकोट गाउँपालिका-८", "रुरुक्षेत्र गाउँपालिका-६", "छत्रकोट गाउँपालिका-६", "धुर्कोट गाउँपालिका-७", "मदाने गाउँपालिका-७", "मालिका गाउँपालिका-८"], 
			["रामपुर नगरपालिका-१०", "तानसेन नगरपालिका-१४", "निस्दी गाउँपालिका-७", "पूर्वखोला गाउँपालिका-६", "रम्भा गाउँपालिका-५", "माथागढी गाउँपालिका-८", "तिनाउ गाउँपालिका-६", "बगनासकाली गाउँपालिका-९", "रिब्दिकोट गाउँपालिका-८", "रैनादेवी छहरा गाउँपालिका-८"], 
			["बुटवल उपमहानगरपालिका-१९", "देवदह नगरपालिका-१२", "लुम्बिनी सांस्कृतिक नगरपालिका-१३", "सैनामैना नगरपालिका-११", "सिद्धार्थनगर नगरपालिका-१३", "तिलोत्तमा नगरपालिका-१७", "गैडहवा गाउँपालिका-९", "कन्चन गाउँपालिका-५", "कोटहीमाई गाउँपालिका-७", "मर्चवारी गाउँपालिका-७", "मायादेवी गाउँपालिका-८", "ओमसतिया गाउँपालिका-६", "सम्मरीमाई गाउँपालिका-७", "सियारी गाउँपालिका-७", "शुद्धोधन गाउँपालिका-७"], 
			["कपिलवस्तु नगरपालिका-१२", "बुद्धभुमी नगरपालिका-१०", "शिवराज नगरपालिका-११", "महाराजगंज नगरपालिका-११", "कृष्णनगर नगरपालिका-१२", "बाणगंगा नगरपालिका-११", "मायादेवी गाउँपालिका-८", "यसोधरा गाउँपालिका-८", "सुद्धोधन गाउँपालिका-६", "विजयनगर गाउँपालिका-७"], 
			["सन्धिखर्क नगरपालिका-१२", "शितगंगा नगरपालिका-१४", "भूमिकास्थान नगरपालिका-१०", "छत्रदेव गाउँपालिका-८", "पाणिनी गाउँपालिका-८", "मालारानी गाउँपालिका-९"], 
			["प्यूठान नगरपालिका-१०", "स्वर्गद्वारी नगरपालिका-९", "गौमुखी गाउँपालिका-७", "माण्डवी गाउँपालिका-५", "सरुमारानी गाउँपालिका-६", "मल्लरानी गाउँपालिका-५", "नौवहिनी गाउँपालिका-८", "झिमरुक गाउँपालिका-८", "ऐरावती गाउँपालिका-६"], 
			["रोल्पा नगरपालिका-१०", "त्रिवेणी गाउँपालिका-७", "परिवर्तन गाउँपालिका-६", "माडी गाउँपालिका-६", "रुन्टीगढी गाउँपालिका-९", "लुङग्री गाउँपालिका-७", "गंगादेव गाउँपालिका-७", "सुनछहरी गाउँपालिका-७", "सुनिल स्मृति गाउँपालिका-८", "थवाङ गाउँपालिका-५"], 
			["तुल्सीपुर उपमहानगरपालिका-१९", "घोराही उपमहानगरपालिका-१९", "लमही नगरपालिका-९", "गलाचुली गाउँपालिका-८", "दंगीशरण गाउँपालिका-७", "गढवा गाउँपालिका-८", "राजपुर गाउँपालिका-७", "राप्ती गाउँपालिका-९", "शान्तिनगर गाउँपालिका-७", "बबई गाउँपालिका-७"], 
			["नेपालगंज उपमहानगरपालिका-२३", "कोहलपुर नगरपालिका-१५", "नरैनापुर गाउँपालिका-६", "राप्ती सोनारी गाउँपालिका-९", "बैजनाथ गाउँपालिका-८", "खजुरा गाउँपालिका-८", "डुडुवा गाउँपालिका-६", "जानकी गाउँपालिका-६"], 
			["गुलरिया नगरपालिका-१२", "मधुवन नगरपालिका-९", "राजापुर नगरपालिका-१०", "ठाकुरबाबा नगरपालिका-९", "बाँसगढी नगरपालिका-९", "बारबर्दिया नगरपालिका-११", "बढैयाताल गाउँपालिका-९", "गेरुवा गाउँपालिका-६"], 
			["बर्दघाट नगरपालिका-१६", "रामग्राम नगरपालिका-१८", "सुनवल नगरपालिका-१३", "सुस्ता गाउँपालिका-५", "पाल्हीनन्दन गाउँपालिका-६", "प्रतापपुर गाउँपालिका-९", "सरावल गाउँपालिका-७"], 
			["पुथा उत्तरगंगा गाउँपालिका-१४", "भूमे गाउँपालिका-९", "सिस्ने गाउँपालिका-८"]
		], 
		[
			["शारदा नगरपालिका-१५", "बागचौर नगरपालिका-१२", "बनगाड कुपिण्डे नगरपालिका-१२", "कालिमाटी गाउँपालिका-७", "त्रिवेणी गाउँपालिका-६", "कपुरकोट गाउँपालिका-६", "छत्रेश्वरी गाउँपालिका-७", "सिद्ध कुमाख गाउँपालिका-५", "कुमाख गाउँपालिका-७", "दार्मा गाउँपालिका-६"], 
			["बीरेन्द्रनगर नगरपालिका-१६", "भेरीगंगा नगरपालिका-१३", "गुर्भाकोट नगरपालिका-१४", "पञ्चपुरी नगरपालिका-११", "लेकवेशी नगरपालिका-१०", "चौकुने गाउँपालिका-१०", "बराहताल गाउँपालिका-१०", "चिङ्गाड गाउँपालिका-६", "सिम्ता गाउँपालिका-९"], 
			["नारायण नगरपालिका-११", "दुल्लु नगरपालिका-१३", "चामुण्डा विन्द्रासैनी नगरपालिका-९", "आठबीस नगरपालिका-९", "भगवतीमाई गाउँपालिका-७", "गुराँस गाउँपालिका-८", "डुंगेश्वर गाउँपालिका-६", "नौमुले गाउँपालिका-८", "महावु गाउँपालिका-६", "भैरवी गाउँपालिका-७", "ठाँटीकाँध गाउँपालिका-६"], 
			["भेरी नगरपालिका-१३", "छेडागाड नगरपालिका-१३", "नलगाड नगरपालिका-१३", "बारेकोट गाउँपालिका-९", "कुसे गाउँपालिका-९", "जुनीचाँदे गाउँपालिका-११", "शिवालय गाउँपालिका-९"], 
			["ठूली भेरी नगरपालिका-११", "त्रिपुरासुन्दरी नगरपालिका-११", "डोल्पो बुद्ध गाउँपालिका-६", "शे फोक्सुन्डो गाउँपालिका-९", "जगदुल्ला गाउँपालिका-६", "मुड्केचुला गाउँपालिका-९", "काईके गाउँपालिका-७", "छार्का ताङसोङ गाउँपालिका-६"], 
			["चन्दननाथ नगरपालिका-१०", "कनकासुन्दरी गाउँपालिका-८", "सिंजा गाउँपालिका-६", "हिमा गाउँपालिका-७", "तिला गाउँपालिका-९", "गुठिचौर गाउँपालिका-५", "तातोपानी गाउँपालिका-८", "पातारासी गाउँपालिका-७"], 
			["खाँडाचक्र नगरपालिका-११", "रास्कोट नगरपालिका-९", "तिलागुफा नगरपालिका-११", "पचालझरना गाउँपालिका-६", "सान्नी त्रिवेणी गाउँपालिका-९", "नरहरिनाथ गाउँपालिका-९", "शुभ कालीका गाउँपालिका-८", "महावै गाउँपालिका-७", "पलाता गाउँपालिका-९"], 
			["छायाँनाथ रारा नगरपालिका-१४", "मुगुम कार्मारोंग गाउँपालिका-९", "सोरु गाउँपालिका-११", "खत्याड गाउँपालिका-११"], 
			["सिमकोट गाउँपालिका-८", "नाम्खा गाउँपालिका-६", "खार्पुनाथ गाउँपालिका-५", "सर्केगाड गाउँपालिका-८", "चंखेली गाउँपालिका-६", "अदानचुली गाउँपालिका-६", "ताँजाकोट गाउँपालिका-५"], 
			["मुसिकोट गरपालिका-१४", "चौरजहारी नगरपालिका-१४", "आठबिसकोट नगरपालिका-१४", "बाँफिकोट गाउँपालिका-१०", "त्रिवेणी गाउँपालिका-१०", "सानी भेरी गाउँपालिका-११"]
		], 
		[
			["बडीमालिका नगरपालिका-९", "त्रिवेणी नगरपालिका-९", "बुढीगंगा नगरपालिका-१०", "बुढीनन्दा नगरपालिका-१०", "गौमुल गाउँपालिका-६", "जगन्नाथ गाउँपालिका-६", "स्वामीकार्तिक खापर गाउँपालिका-५", "खप्तड छेडेदह गाउँपालिका-७", "हिमाली गाउँपालिका-७"], 
			["जयपृथ्वी नगरपालिका-११", "बुंगल नगरपालिका-११", "तलकोट गाउँपालिका-७", "मष्टा गाउँपालिका-७", "खप्तडछान्ना गाउँपालिका-७", "थलारा गाउँपालिका-९", "वित्थडचिर गाउँपालिका-९", "सूर्मा गाउँपालिका-५", "छबिसपाथिभेरा गाउँपालिका-७", "दुर्गाथली गाउँपालिका-७", "केदारस्युँ गाउँपालिका-९", "साइपाल गाउँपालिका-५"], 
			["मंगलसेन नगरपालिका-१४", "कमलबजार नगरपालिका-१०", "साँफेबगर नगरपालिका-१४", "पन्चदेवल विनायक नगरपालिका-९", "चौरपाटी गाउँपालिका-७", "मेल्लेख गाउँपालिका-८", "बान्निगढी जयगढ गाउँपालिका-६", "रामारोशन गाउँपालिका-७", "ढकारी गाउँपालिका-८", "तुर्माखाँद गाउँपालिका-८"], 
			["दिपायल सिलगढी नगरपालिका-९", "शिखर नगरपालिका-११", "पूर्वीचौकी गाउँपालिका-७", "बडीकेदार गाउँपालिका-५", "जोरायल गाउँपालिका-६", "सायल गाउँपालिका-६", "आदर्श गाउँपालिका-७", "के आई सिं गाउँपालिका-७", "बोगटान फुड्सिल गाउँपालिका-७"], 
			["धनगढी उपमहानगरपालिका-१९", "टिकापुर नगरपालिका-९", "घोडाघोडी नगरपालिका-१२", "लम्कीचुहा नगरपालिका-१०", "भजनी नगरपालिका-९", "गोदावरी नगरपालिका-१२", "गौरीगंगा नगरपालिका-११", "जानकी गाउँपालिका-९", "बर्दगोरिया गाउँपालिका-६", "मोहन्याल गाउँपालिका-७", "कैलारी गाउँपालिका-९", "जोशीपुर गाउँपालिका-७", "चुरे गाउँपालिका-६"], 
			["भीमदत्त नगरपालिका-१९", "पुर्नवास नगरपालिका-११", "वेदकोट नगरपालिका-१०", "महाकाली नगरपालिका-१०", "शुक्लाफाँटा नगरपालिका-१२", "बेलौरी नगरपालिका-१०", "कृष्णपुर नगरपालिका-९", "बेलडाडी गाउँपालिका-५", "लालझाडी गाउँपालिका-६"], 
			["अमरगढी नगरपालिका-११", "परशुराम नगरपालिका-१२", "आलिताल गाउँपालिका-८", "भागेश्वर गाउँपालिका-५", "नवदुर्गा गाउँपालिका-५", "अजयमेरु गाउँपालिका-६", "गन्यापधुरा गाउँपालिका-५"], 
			["दशरथचन्द नगरपालिका-११", "पाटन नगरपालिका-१०", "मेलौली नगरपालिका-९", "पुर्चौडी नगरपालिका-१०", "सुर्नया गाउँपालिका-८", "सिगास गाउँपालिका-९", "शिवनाथ गाउँपालिका-६", "पञ्चेश्वर गाउँपालिका-६", "दोगडाकेदार गाउँपालिका-८", "डीलासैनी गाउँपालिका-७"], 
			["महाकाली नगरपालिका-९", "शैल्यशिखर नगरपालिका-९", "मालिकार्जुन गाउँपालिका-८", "अपिहिमाल गाउँपालिका-६", "दुहुँ गाउँपालिका-५", "नौगाड गाउँपालिका-६", "मार्मा गाउँपालिका-६", "लेकम गाउँपालिका-६", "ब्याँस गाउँपालिका-६"]
		]
	];

	jQuery("select").on("change", function () {

	  var get_select_dropdown = jQuery(this).attr("id");

	  if (jQuery.inArray(get_select_dropdown, select_box_id) >= 0) {

	    switch (get_select_dropdown) {

	      case "pradesh-list":
	        pradesh_change("pradesh-list");
	        break;
	      case "district-list":
	        district_change("district-list");
	        break;
	      case "gau-nagar-palika-list":
	        gau_nagar_change("gau-nagar-palika-list");
	        break;
	      default:
	    }

	  }

	});

	function pradesh_change(listpradesh) {

	  if (jQuery("select#" + listpradesh).val() == jQuery("select#" + listpradesh + " option:selected").text()) {

	    if (jQuery.inArray(jQuery("select#" + listpradesh).val(), pradesh) >= 0) {

	      var get_pradesh_index = parseInt(jQuery.inArray(jQuery("select#" + listpradesh).val(), pradesh));

	      jQuery("select#district-list option:not(:first)").remove();
	      jQuery("select#gau-nagar-palika-list option:not(:first)").remove();
	      jQuery("select#ward-list option:not(:first)").remove();

	      jQuery.each(pradesh_district[get_pradesh_index], function (index, element) {

	        jQuery("select#district-list").append('<option value="' + element + '">' + element + "</option>");

	      });

	    } else {

	      jQuery("select#district-list option:not(:first)").remove();
	      jQuery("select#gau-nagar-palika-list option:not(:first)").remove();
	      jQuery("select#ward-list option:not(:first)").remove();
	    }

	  } else {

	    jQuery("select#district-list option:not(:first)").remove();
	    jQuery("select#gau-nagar-palika-list option:not(:first)").remove();
	    jQuery("select#ward-list option:not(:first)").remove();

	  }
	}

	function district_change(listdistrict) {

	  if (jQuery("select#" + listdistrict).val() == jQuery("select#" + listdistrict + " option:selected").text()) {
	    
	    len = pradesh_district.length;

	    for (var x = 0; x < len; x++) {

	      if (jQuery.inArray(jQuery("select#" + listdistrict).val(), pradesh_district[x]) >= 0) {

	        var get_district_index = parseInt(jQuery.inArray(jQuery("select#" + listdistrict).val(), pradesh_district[x]));

	        jQuery("select#gau-nagar-palika-list option:not(:first)").remove();
	        jQuery("select#ward-list option:not(:first)").remove();

	        jQuery.each(sthaniya_palika[x][get_district_index], function (index, element) {

	          var get_sthaniya_value_arr = element.split("-");
	          jQuery("select#gau-nagar-palika-list").append('<option value="' + element + '">' + get_sthaniya_value_arr[0] + "</option>");

	        });
	        break;

	      } else {

	        jQuery("select#gau-nagar-palika-list option:not(:first)").remove();
	        jQuery("select#ward-list option:not(:first)").remove();

	      }
	    }

	  } else {

	    jQuery("select#gau-nagar-palika-list option:not(:first)").remove();
	    jQuery("select#ward-list option:not(:first)").remove();

	  }
	}
	

	function gau_nagar_change(gaunNagar) {

	  var splitted_val = jQuery("select#" + gaunNagar).val().split("-");

	  if (splitted_val[0] == jQuery("select#" + gaunNagar + " option:selected").text()) {

	    var len = sthaniya_palika.length;

	    Loop1: for (var x = 0; x < len; x++) {

	      Loop2: var each_sthaniya_len = sthaniya_palika[x].length;

	      for (var y = 0; y < each_sthaniya_len; y++) {

	        if (jQuery.inArray(jQuery("select#" + gaunNagar).val(), sthaniya_palika[x][y]) >= 0) {

	          var sthaniyaIndex = parseInt(jQuery.inArray(jQuery("select#" + gaunNagar).val(), sthaniya_palika[x][y]));

	          jQuery("select#ward-list option:not(:first)").remove();

	          var each_splitted_arr = sthaniya_palika[x][y][sthaniyaIndex].split("-");	          
	          var get_ward_num = each_splitted_arr[1].split("");
	          var ward_to_eng = "";

	          for (var j = 0; j < get_ward_num.length; j++) {

	            ward_to_eng += eng_num[nep_num.indexOf(get_ward_num[j])];

	          }


	          
	          for (var k = 1; k <= ward_to_eng; k++) {

	          	var get_nep_num_ward = convert_to_nepali(k);

	            jQuery("select#ward-list").append('<option value="' + get_nep_num_ward + '">' + get_nep_num_ward + "</option>");
	          }
	          
	          break Loop1;

	        } else {

	          jQuery("select#ward-list option:not(:first)").remove();
	        }
	      }
	    }
	    ;
	  } else {

	    jQuery("select#ward-list option:not(:first)").remove();

	  }
	}

	function convert_to_nepali(engNum){

		var splitted_eng_num_arr = engNum.toString().split("");

		var wardin_nep_num = '';

		for( var i=0; i < splitted_eng_num_arr.length; i++ ){

			wardin_nep_num += nep_num[eng_num[splitted_eng_num_arr[i]]];

		}

		return wardin_nep_num;
	}

});